Repository: hilalalhakani/NodeCrypto
Catalog: NodeCrypto Localizations/*.xcloc/Localized Contents/*.xliff
Languages: fr

source: By connecting your wallet, you agree to our
fr: En connectant votre portefeuille, vous acceptez notre

source: Choose your wallet
fr: Choisissez votre portefeuille

source: Connect Wallet
fr: Connecter le Portefeuille

source: Metamasak
fr: Metamask

source: Privacy and Policy
fr: Confidentialité et politique

source: Terms of Service
fr: Conditions d'utilisation

source: and our
fr: et notre

source: A new NFT experience
fr: Une nouvelle expérience NFT

source: Enjoy trading and collecting NFTs with minimal fees and maximum value.
fr: Profitez du trading et de la collecte de NFTs avec des frais minimaux et une valeur maximale

source: Explore and trade in a diverse world of digital art and collectibles.
fr: Explorez et échangez dans un monde diversifié d'art numérique et de collectibles

source: Get started now
fr: Commencez maintenant

source: Get success in the crypto art
fr: Réussissez dans l'art crypto

source: Immerse yourself in a cutting-edge platform for NFT discovery and acquisition.
fr: Plongez-vous dans une plateforme de pointe pour la découverte et l'acquisition de NFT

source: Lowest fees in the market
fr: Les frais les plus bas du marché

source: Skip
fr: Passer

source: The new NFT marketplace
fr: Le nouveau marché NFT

source: Unlock your potential in a booming market of crypto-based artistry.
fr: Débloquez votre potentiel dans un marché en plein essor de l'art basé sur la crypto
